[
 {
   "id": 1,
   "actor_name": "Stephen Amell",
   "superhero_name": "Green Arrow",
   "superhero_aka1": "Dark Arrow",
   "superhero_aka2": "The Spectre",
   "alter_ego_name": "Oliver Queen",
   "alter_ego_2": "",
   "character_description": "The Green Arrow (a.k.a. Oliver Queen) was a vigilante who, after being shipwrecked and lost at sea for five years on a remote island in the North China Sea called Lian Yu (Mandarin for Purgatory) returned home to Starling City (later Star City). After working alone for as a vigilante to fulfill his father's dying wish for him to clean up his city, he created a team of heroes that would go on to save the multiverse entore, however, that same fight would not only lead him to his destiny of becomeing something greater (The Spectre) but would also cost him his life.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth X",
   "which_earth_3": "Earth 16",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/9/9a/Oliver_Queen_on_a_target_background.png",
   "photo_link_2": "https://i.pinimg.com/originals/f6/db/c8/f6dbc8f2654156184156a1dce3b60112.jpg",
   "photo_link_3": "https://static2.srcdn.com/wordpress/wp-content/uploads/2020/01/Arrow-Oliver-Queen-The-Spectre-Crisis-on-Infinite-Earths.jpg?q=50&fit=crop&w=740&h=370"
 },
 {
   "id": 2,
   "actor_name": "David Ramsey",
   "superhero_name": "Spartan",
   "superhero_aka1": "Green Arrow v2",
   "superhero_aka2": "Green Lantern",
   "alter_ego_name": "John Diggle",
   "alter_ego_2": "John Stewart",
   "character_description": "After originally operating as a body guard to Oliver Queen when the latter first became the Green Arrow (unbeknownst to John) and a member of the United States Special Forces, he would go on to become one of Oliver Queen's closest friends and the Green Arrow's teammate. Upon Oliver Queen's temporary retirement from vigilatism in order to take care of his family, he would go on to become one of the few members of his team who would take on the mantle of the Green Arrow at the request of Oliver Queen. However, through his time as working with Oliver Queen and the other members of his team, a larger destiny, one as the interplanetary protector, the Green Lantern, is hinted at in many forms and will also possibly continue to be seen upon his move to Metropolis with this son John Diggle Jr., daughter Sara and his wife Lyla Michaels who serves as the head of the branch of ARGUS, a U.S. Military Installation in Metropolis.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 90",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/7/79/John_Diggle_character_promo.png",
   "photo_link_2": "https://static.wikia.nocookie.net/arrow/images/1/10/John_Diggle_season_4_promo_-_mask_and_jacket.png",
   "photo_link_3": "https://tvline.com/wp-content/uploads/2020/01/arrow-series-finale-diggle-green-lantern-spoilers.jpg?w=620"
 },
 {
   "id": 3,
   "actor_name": "Colton Haynes",
   "superhero_name": "Arsenal",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Roy Harper",
   "alter_ego_2": "",
   "character_description": "Originally a street thief who got caught in the crosshairs of the Star City Police Department and Thea Queen, the woman who would one day become his fiancee, for stealing her purse among other petty crimes, he would go on to become Arsenal, the red-hooded protege of Green Arrow. His loyalty to his team, his fiancee and his mentor is unquestioned, with him going so far as to dying and being resurrected to protect his fiancee. However, upon being resurrected, filled with an uncontrollable rage, he exiled himself to Lian Yu to avoid being a danger to those around him. However, in a potential future he goes on to once more become Arsenal alongside the children of his current teammates and also goes on to help Oliver Queen fulfill his destiny as the Green Arrow and the wishes of the intergalactic being known as the Monitor.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/4/4a/Roy_Harper_character_promo.png",
   "photo_link_2": "https://static.wikia.nocookie.net/arrow/images/c/ce/Arsenal_fight_club_promotional.png",
   "photo_link_3": "https://static.onecms.io/wp-content/uploads/sites/6/2018/09/ar716a_0500b-2000.jpg"
 },
 {
   "id": 4,
   "actor_name": "Willa Holland",
   "superhero_name": "Speedy",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Thea Queen",
   "alter_ego_2": "",
   "character_description": "The sister of Oliver Queen, Thea, after learning of her brother's work as a vigilante and as the Green Arrow and upon discovering her true parentage as the daughter of Malcolm Merlyn, a member of the League of Assassins and an archer, in her own right would go on to join her brother in the field as the archer known as Speedy, based on a nickname given to her by her parents and brother. She would also go on to assist her brother both as his assistant while he served as the Mayor of Star City and as the leader of the League of Heroes, a reformed League of Assassins, alongside Talia Al Ghul, the daughter of the original leader of the aforementioned group.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/5/54/Thea_Queen_character_promo.png",
   "photo_link_2": "https://static.wikia.nocookie.net/p__/images/6/68/Arrow-S4-Speedy.jpg",
   "photo_link_3": "https://dctvfashionblog.com/wp-content/uploads/2019/10/vlcsnap-2019-10-30-19h13m35s150-450x450.jpg"
 },
 {
   "id": 5,
   "actor_name": "Matt Ryan",
   "superhero_name": "Constantine",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "John Constantine",
   "alter_ego_2": "",
   "character_description": "A master magician in his own right, John Constantine, despite his own dark past, would go on to save Oliver Queen's life when he visited the island of Lian Yu to retrieve a magical artifact and would later assist him in Star City with the resurrection of his close friend Sara Lance. He also would go on to assist a team formed by Rip Hunter and later led by Sara Lance (the Legends) in stopping a time demon and other mystical creatures as well as in saving the multiverse entire alongside a team of heroes put together by the Monitor.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/5/52/John_Constantine_first_look_promo.png",
   "photo_link_2": "https://img.cinemablend.com/filter:scale/cb/7/d/c/f/5/d/7dcf5d0bd85f8a7f8f352576cc628fa47666bceb913b64be04850ee28cf34084.jpg?mw=600",
   "photo_link_3": "https://imgix.bustle.com/uploads/image/2018/11/24/b9d3f27d-cdc8-48c5-8974-271abf7f2480-lgn406a_0091b.jpg"
 },
 {
   "id": 6,
   "actor_name": "Grant Gustin",
   "superhero_name": "The Flash v2",
   "superhero_aka1": "Green Arrow",
   "superhero_aka2": "",
   "alter_ego_name": "Barry Allen",
   "alter_ego_2": "Oliver Queen",
   "character_description": "After witnessing the death of his mother at the hands of something unexplainable as a young boy for which his father would be wrongfully convicted, Barry Allen went on to become a CSI Detective as an adult in the Central City Police Department and after a \"freak accident\" caused by a particle accelerator created by the founder of STAR Labs, Harrison Wells, who would later be revealed to be Barry Allen's worse nemesis, Eobard Thawne (the Reverse Flash), he would go on to become The Flash, the fastest man alive. Fighting alongside his team and Harrison Wells, prior to his being unmasked as Eobard Thawne, he would go on to stop criminals who had gained powers such as his in the particle accelerator explosion. He would also go on to find himself face-to-face with enemies from other earths in the multiverse and to one day as a Paragon recruited by the Monitor, join Oliver Queen and a team of heroes in saving the multiverse entire.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/9/96/The_Flash_season_3_Duet_poster_-_Barry_Allen.png",
   "photo_link_2": "https://static.wikia.nocookie.net/arrow/images/0/0e/The_Flash_season_6_-_Entertainment_Weekly_Barry_Allen_promo_1.png",
   "photo_link_3": "https://static.wikia.nocookie.net/arrow/images/6/62/Barry_Allen_as_Green_Arrow.png"
 },
 {
   "id": 7,
   "actor_name": "Carlos Valdes",
   "superhero_name": "Vibe",
   "superhero_aka1": "Reverb",
   "superhero_aka2": "",
   "alter_ego_name": "Francisco Ramon",
   "alter_ego_2": "",
   "character_description": "One of the few \"employees\" of STAR Labs recruited by Harrison Wells before his unmasking as the Reverse Flash, which is also one of the many names assigned to villains by Cisco, he would assist Barry Allen in capturing superpowered criminals in his hometown of Central City before realizing his destiny as the hero Vibe, a super-powered hero with vibrational powers. This is also a power he would find carried across the multiverse and to some of his doppelgangers, both good and evil. He would later give up this power to pursue a normal life as a scientist but would also be temporarily restored with these powers by the Monitor in an attempt to help a team of Paragons in defeating his evil counterpart, the Anti-Monitor to save the multiverse",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 2",
   "which_earth_3": "",
   "photo_link": "https://m.media-amazon.com/images/M/MV5BNzIwMzU1NzI2N15BMl5BanBnXkFtZTgwMTEyMTMyNzE@._V1_.jpg",
   "photo_link_2": "https://static.wikia.nocookie.net/theflash/images/8/83/Vibe_Carlos_Valdes-6.jpg",
   "photo_link_3": "https://static.wikia.nocookie.net/theflash/images/a/a0/Reverb_Carlos_Valdes.jpg"
 },
 {
   "id": 8,
   "actor_name": "Danielle Panabaker",
   "superhero_name": "Killer Frost",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Caitlin Snow",
   "alter_ego_2": "",
   "character_description": "Part biochemist, part reformed villain with a pechant for ice equals one cool (pun intended) superhero. Caitlin Snow's story started as a scientist recruited by Harrison Wells prior to his unmasking as the Reverse Flash to help him in creating the STAR Labs Particle Accelerator which would one day create the hero known as the Flash. However, through her fair share of adventures and life-or-death situations, some of which almost put her on thin ice, she would one day come face to face with her doppelganger from Earth-2, a killer with a heart of ice, aptly nicknamed Killer Frost, in the lockup of her captor, Hunter Zolomon. While she swore to herself and to her team that she would never become her doppelganger after being freed of Hunter Zolomon, after a couple of tragic episodes in which she almost did become Killer Frost, thanks to her team and with a small assist from Ralph Dibney - The Elongated Man, her alter ego would become the hero known as Frost as she learned what it meant to work as hero and to be human. She would also become part of a much larger destiny in helping a team of Paragons and an intergalactic being known as The Monitor in saving the Multiverse entire from destruction.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 2",
   "which_earth_3": "",
   "photo_link": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F07%2Ffla417a_0067b-2000.jpg",
   "photo_link_2": "https://www.danezon.com/wp-content/uploads/2019/01/Killer-Frost-Flash-Season-4-Denim-Jacket.jpg",
   "photo_link_3": "https://www.hypable.com/wp-content/uploads/2019/10/the-flash-6x02-killer-frost-e1573663639671.jpg"
 },
 {
   "id": 9,
   "actor_name": "Robbie Amell",
   "superhero_name": "Firestorm",
   "superhero_aka1": "Deathstorm",
   "superhero_aka2": "",
   "alter_ego_name": "Ronald Raymond",
   "alter_ego_2": "Martin Stein",
   "character_description": "The late Ronnie Raymond's story started very similar to that of the woman who would become his wife, Caitlin Snow, in a wedding that would lead to his untimely death. However, after accidentally merging with Dr. Martin Stein after the Particle Accelerator explosion and becoming one half of the superhero known as Firestorm, he would truly learn what it means to be a hero as he would have to learn how to co-exist in a single human body with the other half and the brains of Firestorm, Dr. Martin Stein. However, shortly after his wedding, when a black hole which would reveal the existence of the multiverse to the world opened up over his hometown, with an assist from Barry Allen's superhero alter-ego, the Flash, he would utilize his powers in closing it but in doing so would make the ultimate sacrifice.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 2",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/d/d2/Firestorm_fight_club_promotional.png",
   "photo_link_2": "https://i.pinimg.com/originals/f9/39/a8/f939a8790e8b4a2fbc0235213e510383.jpg",
   "photo_link_3": "https://static.wikia.nocookie.net/theflash/images/e/ed/Martin_Stein_Victor_Garber-4.jpg"
 },
 {
   "id": 10,
   "actor_name": "Katherine McNamara",
   "superhero_name": "Green Arrow v4",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Mia Queen",
   "alter_ego_2": "",
   "character_description": "Socialite, sister, daughter, fiancee and most importantly, hero are a few of the words that would come to be associated with the daughter of the late Oliver Queen. When the Green Arrow's team first meets his daughter in the year 2040, she would end out nearly handing them a crushing defeat in a steel cage fight despite the complete lack of powers of her own. As it would turn out, the real reason that she would fight in steel cage matches was due to repressed anger over the death of her father in the year 2020 which would lead to a hatred of vigilantism and heroism. That, and she needed information from other lowlifes who she fought to get information about her abducted mother, the wife of the Green Arrow and the hero known as Overwatch, Felicity Smoak. Along the way, she would end out meeting her brother after being separated from him at birth and would learn, partly from being part of a group called The Canaries and from being part of a much larger plan set in motion by The Monitor which would transport her and hers from the year 2040 to 2020 where she would meet her father and help in overcoming the Crisis and stopping the destruction of the Multiverse, what it means to be a hero and would adopt the mantle of Green Arrow after her father's death.  She would also find that family - what she believed to be her greatest weakness and the people she believed to be her greatest enemies would become her greatest strength.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://tvguide1.cbsistatic.com/i/2019/05/10/2351c9fd-6cea-406b-aa6d-26a1492bee20/190510-katherine-mcnamara-arrow.jpg",
   "photo_link_2": "https://www.dccomics.com/sites/default/files/imce/2019/12-DEC/source-AR803a0098b_5deeac9ac90981.77728676.jpg",
   "photo_link_3": "https://i.pinimg.com/originals/52/ee/bf/52eebfae6aaad2bae2c9a13347fe93f3.jpg"
 },
 {
   "id": 11,
   "actor_name": "Rick Gonzales",
   "superhero_name": "Wild Dog",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Rene Ramirez",
   "alter_ego_2": "",
   "character_description": "Whether he's the vigilante known as Wild Dog by night or the Mayor of The Glades by day, Rene Ramirez cannot and will not stop fighting to make Star City a safer place for his daughter, Zoe Ramirez. After the tragic loss of his wife to gun violence and almost losing his daughter to the foster care system, Rene Ramirez would find his peace in puttin on a hockey mask and jersey and fighting alongside the Green Arrow and his team to earn redemption as Wild Dog. While facing a few stumbling blocks along the way in the year 2040 after almost aligning himself unknowningly with the eco-terrorist group known as Eden Corps, which he would also be informed about 20 years before it happens by Mia upon her arrival in the year 2020 (this partly because of the anger associated with the loss of her teammate and friend, Zoe Ramirez, in the field in 2040, due to events set in motion by Rne during his accidental alliance with Eden Cops) he would become a reformed deputized hero and Mayor of the Glades and would go on to serve three terms as the Mayor.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/8/84/Rene_Ramirez_%28Earth-2%29.png",
   "photo_link_2": "https://static.wikia.nocookie.net/arrow/images/f/f2/Wild_Dog%27s_makeshift_outfit.png",
   "photo_link_3": "https://i2.wp.com/geeksofcolor.co/wp-content/uploads/2017/12/arrow-editorial.jpg?fit=1440%2C900&ssl=1"
 },
 {
   "id": 12,
   "actor_name": "Juliana Harkavy",
   "superhero_name": "Black Canary",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Dinah Drake",
   "alter_ego_2": "",
   "character_description": "When the Green Arrow and his team first met Dinah Drake, the team was looking for someone to take up the mantle of Black Canary after the death of Earth 1's Laurel Lance at the hands of Damien Dhark and Dinah was a vigilante and undercover detective for the Central City Police Department under the moniker Tina Boland looking for the killer of her boyfriend, who would later be revealed to be alive and operating as the vigilante known as well....Vigilante. After a couple of less than agreeable encounters with the Green Arrow and his team, she would end out learning that revenge will not help find peace and would join the team and the Star City Police Department for a shot at redemption. After earning the monikers of Black Canary and Captain of the SCPD, she would find that she was part of a much larger destiny that spanned across a time period of over 20 years and a multiverse. She would also become the co-founder of the group of vigilantes in the year 2040 known as The Canaries and would work with them and Mia Queen's team to defeat Eden Corps prior to the erasure of that timeline after Oliver Queen, prior to commiting the ultimate sacrifice, would re-set the timeline and the multiverse. However, she also finds that she becomes part of a much larger mystery after the funeral of the Green Arrow when she gets on a bike to leave Star City in 2020 but wakes up the next day in 2040 with no memory of how she got there and with her existence completely erased from the minds of the public. ",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://i.pinimg.com/originals/c7/78/3a/c7783a4dab57b470d24bfd29e32a1db7.jpg",
   "photo_link_2": "https://static.wikia.nocookie.net/arrow/images/c/cb/Dinah_Drake_in_her_Black_Canary_suit_promo.png",
   "photo_link_3": "https://www.bayperfect.com/wp-content/uploads/2020/07/Arrow-TV-Series-Dinah-Drake-Jacket-1.jpg"
 },
 {
   "id": 13,
   "actor_name": "Katie Cassidy Rodgers",
   "superhero_name": "Black Canary",
   "superhero_aka1": "Black Siren",
   "superhero_aka2": "",
   "alter_ego_name": "Laurel Lance",
   "alter_ego_2": "",
   "character_description": "Laurel Lance - ADA, DA, hero and paradoxically, villain. After starting her story on Earth 1 as a clerk in the CNRI dealing with small civil and criminal cases in what would become a much larger career as an attorney, she would go on to save 2 Universes and destroy another one. Her story as a vigilante starts after the death of her sister, Sara Lance (for the 3rd time), when she meets former vigilante Wildcat - Ted Grant, and learns to fight and after training alongside the daughter of the founder of the League of Assassins, Nyssa Ratkco. She would, in her anger, become the hero known as the Black Canary taking the mantle from her sister and fighting alongside the Green Arrow's team to save her city and to avenge her sister's death. She would also be revealed to be going through her own redemption arc as an alcohol and substance abuse addict to fight the repressed anger after the death and re-birth of her sister. However, after losing that anger and truly learning what it means to be a hero, she would save her city from a nuclear attack, a seige by the infamous Slade Wilson. a.k.a. Deathstroke, and a nefarious undertaking. However, after he death, the existence of her doppelganger from Earth 2, a villain and killer known as Black Siren is revealed and that version of Laurel Lance, after going through her own redemption arc on Earth 1, would end out assisting Oliver Queen in saving the multiverse. However, she is also shown to have another doppelganger in another earth which shall not be named as it is that bad who thankfully leads to the destruction of that earth.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 2",
   "which_earth_3": "Earth X",
   "photo_link": "https://pyxis.nymag.com/v1/imgs/d1b/853/4c99bf2766a983fa5d6bc4e5e616c01222-laurelarms.rsquare.w330.jpg",
   "photo_link_2": "https://upload.wikimedia.org/wikipedia/en/5/53/Black_Canary_%28Katie_Cassidy%29.jpg",
   "photo_link_3": "https://telltaletv.com/wp-content/uploads/2019/11/AR806A_0200b.jpg"
 },
 {
   "id": 14,
   "actor_name": "Caity Lotz",
   "superhero_name": "Canary",
   "superhero_aka1": "White Canary",
   "superhero_aka2": "",
   "alter_ego_name": "Sara Lance",
   "alter_ego_2": "",
   "character_description": "Sara Lance and the concepts of Pain and Death have a very loose, if no, connection. One might say that she is immortal or a Legend. Her story starts on the Queen's Gambit, a yacht owned by the Queen Family, which capsizes in the North China Sea after it is sabotaged by Malcolm Merlyn after which she is presumed dead at sea for several years. However, she is later shown to be alive and operating as the vigilante known as The Canary, going through a redemption arc after joining the League of Assassins and trying to leave it. She is also shown to be alive shortly after the boat capsized and operating alongside Oliver Queen, who at that time was also presumed dead at sea, on the island of Lian Yu, albeit making it there almost a year after the boat cpsized where Oliver made it there almost immediately, to defeat Anton Ivo, a scientist who created a super serum known as Mirakuru to create superhuman soldiers. That serum would also end out falling into the hands of Slade Wilson and would lead to her second presumed death on board another ship known as The Amazo. She would also later die, yet again, as The Canary and be resurrected, again, by John Constantine, and become the time-travelling hero and Paragon known as White Canary and would assist the other Paragons and The Monitor in stopping the destruction of the multiverse entire.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/5/57/DC%27s_Legends_of_Tomorrow_-_Sara_Lance_character_portrait.png",
   "photo_link_2": "https://static.wikia.nocookie.net/arrow/images/0/0c/The_Canary_season_3_promotional_image.png",
   "photo_link_3": "https://static.wikia.nocookie.net/arrow/images/d/d2/DC%27s_Legends_of_Tomorrow_season_5_-_Entertainment_Weekly_Sara_Lance_promo_2.png"
 },
 {
   "id": 15,
   "actor_name": "Brandon Routh",
   "superhero_name": "The Atom",
   "superhero_aka1": "Superman",
   "superhero_aka2": "",
   "alter_ego_name": "Ray Palmer",
   "alter_ego_2": "Clark Kent",
   "character_description": "One of the rare heroes to have two destinies, one as The Atom and one as the powerful DC superheroes of all time, Superman, both as Ray Plamer and as Clark Kent, he more than takes up the challenge and sacrifices of being a hero. His story as The Atom & Ray Palmer start after his acquisition of Queen Consolidated which he proceeds to use as a base of opeartions for his heroics as The Atom. While having no unique powers of his own apart from a very high IQ and scenitific mind, he would build a mechanical super-suit capable of shrinking to the size of an Atom among other abilities after the death of his fiancee at the hands of thugs controlled by Slade Wilson, to try and protect his city and to make sure that what happened to his fiancee will not happen to anyone else. While starting out on opposing views with the Green Arrow, they learn to work together and after a near death situation and a re-evaluation of what it means to be a hero, he takes his place as a Legend and chief scientist aboard th timeship Waverider after being recruited to the team by a time master known as Rip Hunter. His story as Clark Kent and Superman on the other hand could not be more different. After arriving on Earth 96 in a pod as a baby after the death of his home planet Krypton, he would go on to learn what it means to be a hero and control and hone his powers to become one of Earh 96's most powerful, if not the most powerful heroes, Superman. After defeating Lex Luthor multiple times over and taking his place at the Daily Planet as the chief. he also experiences loss and heartbreak after a bomb is set off inside the Daily Planet which would end out killing his wife, Lois Lane which would also orphan his son, Jason, and would kill his closes friend and forer editor of the Planet, Perry White. However, after being recruited to save the Multiverse as a Paragon by the Superman of Earth 38 along with his allies, he goes on to start to save the multiverse before falling victim to another one of Lex Luthor's (this time, the version from Earth 38) schemes but would eventually be shown to be alive on Earth 96 once again after the resurrection of the multiverse caused by Oliver Queen's sacrifice.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 96",
   "which_earth_3": "",
   "photo_link": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2019%2F10%2Flgn413a_0265b2-2000.jpg",
   "photo_link_2": "https://static.wikia.nocookie.net/greenarrow/images/a/ad/The_Atom_Brandon_Routh.jpg",
   "photo_link_3": "https://static2.cbrimages.com/wordpress/wp-content/uploads/2020/01/brandon-routh-superman-farewell.jpg"
 },
 {
   "id": 16,
   "actor_name": "Tyler Hoechlin",
   "superhero_name": "Superman",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Clark Kent",
   "alter_ego_2": "",
   "character_description": "Meet Earth 38's most powerful hero and possibly the most powerful hero in the multiverse, Superman! Born Kal-El on the planet Krypton before it was destroyed, he was sent down to Earth in a pod by his parents shortly before the planet's destruction and shortly before his cousin was sent down to Earth on a similar pod with a different story. When the heroes of Earth 1 and Earth 38 first meet Superman's mild mannered alter ego Clark Kent, he's busy being berated by the editor of the Daily Planet, Perry White, over the phone while picking up a newspaper in Metropolis. Shorty thereafter, the adventures begin with him helping his cousin stop a rocket from crash landing on Earth, stopping a kryptonite powered rage monster and a general with a mistrust of all things alien among other villains. However, everytime he has contemplated a temporary retirement, especially after discovering the existence of Argo City in space, the last remaining living vestiges of the planet he considers home, Superman is needed to save the day both on Earth 38 and Earth 1 when recruited by the Green Arrow and the Flash to stop what almost becomes the ultimate destruction of the multiverse. However, just as Superman finally gets ready to hang up his cape, he is infomred of his greatest challenge yet, being a parent to two teenage boys who very possibly have latent powers of their own.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 38",
   "which_earth_3": "",
   "photo_link": "https://supergirl.tv/media/com_twojtoolbox/011-clarkkent.jpg",
   "photo_link_2": "https://static.wikia.nocookie.net/marvel_dc/images/4/47/Kal-El_Arrow_Earth-38_0004.jpg",
   "photo_link_3": "https://tvline.com/wp-content/uploads/2020/12/superman-suit-full.jpg"
 },
 {
   "id": 17,
   "actor_name": "Melissa Benoist",
   "superhero_name": "Supergirl",
   "superhero_aka1": "Overgirl",
   "superhero_aka2": "",
   "alter_ego_name": "Kara Danvers",
   "alter_ego_2": "",
   "character_description": "Kara Zor-El, the older (as she likes to frequently remind Kal/Clark whenever she seas him) of the two super cousins on Earth 38, was sent by her parents in a pod to Earth just prior to the destruction of Krypton. However, the similarities in their origin stories end there. While Kal-El was raised and taught his whole lfe on Earth to train and hone his powers to become the hero called Superman, Kara's pod got knocked off course and was stuck in the Phantom Zone for several years beofre it was released and made it to Earth. As a result, when she arrived on Earth, by Earth standards, she was still a child while her cousin had already grown into Superman. Raised by Jeremaiah Danvers and his family, Kara became a reporter, much like her cousin, except at CatCo Worldwide Media in National City. However, when tragedy almost strikes for her foster sister, Alex, Kara springs into action and exposes her powers to the world. After this, she begins working in secret as Supergirl, much to her foster mother's initial diisapproval and creates her own team while also working alongside her sister, unofficially at first, at the DEO, a givernment agency on Earth 38 set up to monitor alien life on Earth. While she has had a longer and by far stranger learning curve when it comes to being a hero in comparison to her cousin, Superman has on many occassions, self admitted that she is also the stronger of the two. Over time, after the discovery of the existence of the multiverse, she has also fought alongside the Green Arrow, the Flash and their respective teams as a protector of Earth 1. She is also recruited as a Paragon alongside her cousin by The Monitor to stop the Anti-Monitor Crisis and the ultimate destruction of the multiverse entire. ",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 38",
   "which_earth_3": "",
   "photo_link": "https://imgix.bustle.com/2017/3/21/51167341-64e6-4d8f-a791-ed316449b493.jpg",
   "photo_link_2": "https://cdn.streamdaily.tv/wp/wp-content/uploads/2016/07/supergirl2.jpg",
   "photo_link_3": "https://parade.com/wp-content/uploads/2019/10/super-girl.jpg"
 },
 {
   "id": 18,
   "actor_name": "David Harewood",
   "superhero_name": "Martian Manhunter",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Hank Henshaw",
   "alter_ego_2": "J'onn J'onzz",
   "character_description": "When the heroes of Earth 38 first meet Hank Henshaw, he's the director of the DEO who is as hard as nails when it comes to training his agents for the field and when it comes to protocol. He is also, until a pretty major reveal to Alex and Kara, suspected to be the killer of their foster father and is suspected of hiding a pretty big secret. However, after a near death situation, he exposes the fact that he has powers of his own while in the field with Alex and Kara and when they confront him about not revealing it earlier, he reveals to them that he is neither who he says he is or a human but that he is the Martian Manhunter and has been on Earth for several hundred years. He also reveals that he was present when Jeremaiah died but that he was not the cause of it happening and that the real Hank Henshaw had killed their foster father. He also revealed to them that he had been tasked by their father to take care of his girls and as a result, after the death of the real Hank Henshaw, since he is a shapeshifter, he assumed his form and position to blend in with humans and to be able to fulfill his promise. He goes on during several occasions to work as the Martian Manhunter in secret alongside Supergirl's team to protect Eath 38 until his secret is revealed to the world. At that point, he assumes his true identity of J'onn J'onzz and begins to lead life differently as a detective on Earth 38 helping other aliens with their problems until he meets the heroes of Earth 1 and is recruited by them on occassion as an extra hand to help control unstable situations on their Earth. Much like Kara and her cousin, he is also another Paragon recruited by The Monitor to stop the Anti-Monitor Crisis. ",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 38",
   "which_earth_3": "",
   "photo_link": "https://lh3.googleusercontent.com/proxy/LXD_LAV3tNzY9MsAc4e5x45bKTD6fbphOyF9lhtoWU5yhqciFImQHErXrCIeaJtz4e2H2TPmH5UyDaTfY5uXb4vmN7K2Z-wKmV1WNIQcgiK-yPMJazJoYdQ4lxYtrg6bxBZ6dJs",
   "photo_link_2": "https://static.wikia.nocookie.net/dcmovies/images/f/f5/Martian_Manhunter_Arrow.jpg/revision/latest?cb=20190507002329",
   "photo_link_3": "https://static.wikia.nocookie.net/arrow/images/1/1a/J%27onn_new_suit.png/revision/latest?cb=20200511103258"
 },
 {
   "id": 19,
   "actor_name": "Mehcad Brooks",
   "superhero_name": "Guardian",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "James Olsen",
   "alter_ego_2": "",
   "character_description": "Intrepid Reporter and Superman's Best Pal, James Olsen starts off as an investigative reporter for CatCo Worldwide Media after moving from Metropolis to National City to lead the quiet life and to escape his fiancee, i.e., until Supergirl is revealed to the world. However, James, being Superman's Best Pal, already knows her secret and is partly in National City to looks after Superman's cousin at his request, albeit in secret. After Supergirl is revealed to the world, James Olsen tasks himself with assisting her the way he did her cousin as a part of her team. Using his public identity as a famed reporter, he has access to places Supergirl doesn't and uses that to find information she needs to track down whoever is on her list. However, James, despite his exterior personality and wanting to lead the quet life, is never contended with it and is always looking for new fights and opportunities to be useful to the general public in other ways, namely, as a vigilante. This leads him down a path where he becomes Guardian, a move that initially pits him against Supergirl and his friends before they realize why he's doing what he's doing and accept his choice to become Guardian. If being Guardian is not enough, he takes up a position of Chief Editor at CatCo after the retrirement of Cat Grant. However, after a visit to his hometown with his sister and a lot of self-introspection, he decides to retire the mantle of Guardian temporarily as well as his position at CatCo and move there to act as the chief of the local newspaper and to try and bring change to that neighborhood.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth X",
   "which_earth_3": "",
   "photo_link": "https://vignette.wikia.nocookie.net/alwaysjonsa/images/b/bb/James_Olsen_season_1_promotional.png/revision/latest?cb=20171015195334",
   "photo_link_2": "https://deadline.com/wp-content/uploads/2016/10/img_2791.jpg",
   "photo_link_3": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F09%2Fsupergirl-16-2000.jpg"
 },
 {
   "id": 20,
   "actor_name": "John Wesley Shipp",
   "superhero_name": "The Flash v1",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Jay Garrick",
   "alter_ego_2": "Barry Allen",
   "character_description": "The first Flash and the most senior, be it as Earth 90's Barry Allen or as Earth 3's Jay Garrick, this Flash has full command and control over the ways of the Speed Force and is always there to help the others who have carried the mantle of the Flash, whether from his Earth or from other earths in the multiverse. Jay Garrick on Earth 3 recieved his powers in an accident in a lab while working with hard water. When he woke up from his coma, he became the fastest man alive on his earth and with the help of his wife Joan, he helps protect the Speed Force and the Multiverse until he makes the decision to retire and hang up his helmet and train his successor. Earth 90's Barry Allen, on the other hand, received his powers after a lightning strike and trained to use his powers with the help of his ally and friend, Tina McGee. Earth 90's Flash however, during the Anti-Monitor Crisis, after his earth was wiped out, made the ultimate sacrifice in order to help the Paragons and to save Jefferson Pierce, a hero known as Black Lightning, and Earth 1's Flash from having to do the same.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 3",
   "which_earth_3": "Earth 90",
   "photo_link": "https://imgix.bustle.com/rehost/2016/9/14/dda01c87-3af3-4c16-824b-e03ca572377f.jpg",
   "photo_link_2": "https://www.denofgeek.com/wp-content/uploads/2020/09/the-flash-john-wesley-shipp-jay-garrick.jpg?fit=3000%2C2004",
   "photo_link_3": "https://i0.wp.com/cjhawkings.com/wp-content/uploads/2018/12/Geek-Tyrant.jpeg?ssl=1"
 },
 {
   "id": 21,
   "actor_name": "Joseph David-Jones",
   "superhero_name": "Green Arrow v3",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Conner Hawke",
   "alter_ego_2": "John Diggle Jr.",
   "character_description": "When the Legends first meet Conner Hawke, they meet him in the year 2046 in Star City, without the knowledge that they gain a few years later that they travelled to a different earth and not just a different part of the timeline, where he operates as the Green Arrow after the supposed death of Oliver Queen. However, he later reveals to them that he is actually John Jr. the son of Green Arrow's ally, John Diggle, aka Spartan and that he took on the name Conner Hawke after he failed to save his father from his death at the hands of Deathstroke a few years prior to that. The Green Arrow and his team in the year 2020 on Earth 1 also later meet their Earth's doppelganger of Conner Hawke, who happens to be the adoptive son on John Diggle on Earth 1 and the biological son of Ben Turner, the reformed villain and ARGUS agent name Bronze Tiger. This iteration on Conner Hawke, unlike his Earth 16 doppelganger, works in secret as a vigilante in the year 2040 alongside the daughter and son of Oliver Queen and Zoe Ramirez, the daughter of Rene Ramirez, aka, Wild Dog. This doppelganger of Conner is also far more in control of his abilities than his Earth 16 counterpart and is a skilled fighter and strategist, along with being an agent with a secret organization known as Knightwatch, which also happens to have been founded by John Diggle.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 16",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/marvel_dc/images/2/2e/Connor_Hawke_Arrow_0001.jpeg",
   "photo_link_2": "https://townsquare.media/site/442/files/2016/12/arrow-flashpoint-connor-hawke-pic.jpg?w=980&q=75",
   "photo_link_3": "https://assets.mycast.io/posters/connor-hawke-agent-of-knightwatch-fan-casting-poster-35840-large.jpg"
 },
 {
   "id": 22,
   "actor_name": "Andrea Sixtos",
   "superhero_name": "The Canary",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Zoe Ramirez",
   "alter_ego_2": "",
   "character_description": "As the daughter of Rene Ramirez, right from when she was young, she has been exposed to the world as it is, not a sugar-coated, protective bubble. As a result, right from her childhood, she starts training to fight with the help of the Black Canary, Dinah Drake, and grows into her own hero as a Canary in the year 2040 where she fought alongside the remaining members of Team Arrow and Mia, Conner and William to defeat Eden Corps before being killed by Deathstroke (who just so happens in 2040 to be the biological son of John Diggle, John Jr.) in the field before being resurrected by Oliver Queen in the rebuilt multiverse when he made his ultimate sacrifice as the Spectre.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://telltaletv.com/wp-content/uploads/2019/01/AR710B_0001b.jpg",
   "photo_link_2": "https://tv-fanatic-res.cloudinary.com/iu/s--OzMvaI-1--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1572111098/zoe-ramirez-arrow-season-8-episode-2.jpg",
   "photo_link_3": "https://images.squarespace-cdn.com/content/v1/545a69dbe4b0b9bbb0155de6/1573701283871-3PDXL57GOIRDOKLODSKY/ke17ZwdGBToddI8pDm48kHCXpmdJY4etkTA-ZfkV-D5Zw-zPPgdn4jUwVcJE1ZvWQUxwkmyExglNqGp0IvTJZamWLI2zvYWH8K3-s_4yszcp2ryTI0HqTOaaUohrI8PIItMfWWxSoRVptyt_rFJF3XZQ5sJNkziwwqBamaTYCHUKMshLAGzx4R3EDFOm1kBS/AndreaSixtos_Actor_Arrow_GeekNerdNet_5.JPG"
 },
 {
   "id": 23,
   "actor_name": "Sarah Gray",
   "superhero_name": "Stargirl",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Courtney",
   "alter_ego_2": "Merlin",
   "character_description": "When Courtney first met the Legends in the 1940's as part of their adventures, it is as Stargirl, a member of the Justice Society of America, in battle against the Legends when she assumes that they are either spies or insane or possibly both and has them locked up at the JSA's headquarters until they can decide who the Legends really are. However, after one of the Legends reveals himself to be the descendent of one of the members of the JSA, she softens towards them ever so slightly and lets them go but with the order that they leave and that they don't return to that time period again. However, when her life is put into danger and the Legends return to help her, she begins to accept them after one of them nearly laid down his life to protect her. She later returns in the rennaisance period after being left there by Rip Hunter as part of another Legends mission and takes up a position as King Arthur's Court as Merlin, a sorceress and judge, which she uses to protect a piece of the reality altering Spear of Destiny which lay within the castle's walls until the Legends come calling asking for it.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 2",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/e/ea/Courtney.png",
   "photo_link_2": "https://static.wikia.nocookie.net/arrow/images/6/61/Stargirl.png",
   "photo_link_3": "https://static.wikia.nocookie.net/theflash/images/0/05/Stargirl_Sarah_Grey-1.jpg"
 },
 {
   "id": 24,
   "actor_name": "Maisie Richardson-Sellers",
   "superhero_name": "Vixen",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Amaya Jiwe",
   "alter_ego_2": "Charlie",
   "character_description": "Much like Courtney, Amaya meets the Legends for the first time in the 1940's as Vixen, a hero in the Justice Society of America who agrees strongly with Courtney's initial views of the team. However, after being captured during a mission and held alongside a member of the Legends, she begins to realize who they really are and begins to accept them. However, after the leader of the JSA is brutally murdered by a time traveller, her automatic assumption is that it is a specific member of the Legends and she stows away on their timeship to exact revenge for the killing. However, after it is revealed that no member of the Legends killed Rex Tyler, she stays on board as they work against a common enemy and slowly starts warming towards them and becomes a member of the team. Along the way, she also learns of her destiny as a protector of the totems of the ancient village of Zambesi and decides to return there to fulfill that destiny. However, a short while later after Amaya's departure, the team meets another shapeshifter who has taken on the form of Amaya and is no longer able to change form and take her in to prevent her from causing trouble and wrecking the good name of Vixen.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/p__/images/8/8a/Amaya_Profil.jpg",
   "photo_link_2": "https://static.wikia.nocookie.net/marvel_dc/images/6/60/Amaya_Jiwe_Arrow_0001.jpg",
   "photo_link_3": "https://tv-fanatic-res.cloudinary.com/iu/s--Fy8M99_W--/c_scale,f_auto,h_927,q_auto,w_696/v1588003863/charlie-dcs-legends-of-tomorrow-season-5-episode-9"
 },
 {
   "id": 25,
   "actor_name": "Franz Drameh",
   "superhero_name": "Firestorm v2",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Jefferson Jackson",
   "alter_ego_2": "Martin Stein",
   "character_description": "Once a rising football player until his knee was injured as part of the STAR Labs particle accelerator explosion, Jefferson Jackson became a car mechanic until he met Barry Allen and Martin Stein in their hunt for a new half of Firestorm after the death of Ronald Raymond in order to stablize the Firestorm Matrix. However, as he revealed to them, he didn't want superpowers or anything that goes along with it and just wanted his knee fixed so that he could go back to playing football and supporting his mom. However, after the unstable Firestorm Matrix nearly leaves Martin Stein dead and another metahuman with powers very similar to that of Firestorm with a complete lack of control over his powers show up and begins wreaking havoc, Caitlin Snow visits Jax and convinces him to become Firestorm. After the initial bonding disagreements between Martin Stein and Jefferson, part of which occurred due to Martin Stein being overprotective and also drugging him and bringing him on board the Waverider as a Legend against his will, he slowly grew into his role as a Legend, Firestorm and as the chief mechancial engineer of the Waverider. He also grew to see Martin Stein as a father figure after the loss of his father and struggled to see his place on the team after Martin Stein's death, prompting him to leave the team.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://vignette.wikia.nocookie.net/arrow-fanon/images/9/9b/Jefferson_Jackson.png",
   "photo_link_2": "https://static.wikia.nocookie.net/tvdatabase/images/7/75/Legends_of_Tomorrow_2x07_013.jpg",
   "photo_link_3": "https://jackandthegeekstalk.files.wordpress.com/2017/11/firestorm.jpg"
 },
 {
   "id": 26,
   "actor_name": "Matthew MacCaull",
   "superhero_name": "Commander Steel",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Henry Haywood",
   "alter_ego_2": "",
   "character_description": "Former Army Man and metahuman Commander Steel of the Justice Society of America, Henry Haywood is a man of many skills, affectionately called by his team as the Chameleon, due to his ability to speak multiple languages and his ability to blend into any type of culture or environment. As he came to discover when meeting the Legends, his grandson, following in his footsteps, also became a hero and on multiple occassions, most notably in the 1980's as a NASA employee, assisted his grandson and the Legends before throwing himself out of the timeship's hatch and making the ultimate sacrifice to protect the Legends and his grandson.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 2",
   "which_earth_3": "",
   "photo_link": "https://static.wikia.nocookie.net/arrow/images/3/3d/Henry_Heywood.png",
   "photo_link_2": "https://www.dccomics.com/sites/default/files/imce/2016/10-OCT/LGN202b_0036b_cd5072cb_58095a8f742f63.37805023.JPEG",
   "photo_link_3": "https://static.wikia.nocookie.net/arrow/images/f/f8/Henry_Heywood%27s_sacrifice.png"
 },
 {
   "id": 27,
   "actor_name": "Nick Zano",
   "superhero_name": "Citizen Steel",
   "superhero_aka1": "",
   "superhero_aka2": "",
   "alter_ego_name": "Nathaniel Haywood",
   "alter_ego_2": "",
   "character_description": "Nate Haywood's story starts as a time historian in Star City who alerts Oliver Queen to a tragedy which might have altered the realities of the Legends, but continues as Citizen Steel, grandson of the famed Commander Steel of the Justice Society of America after being injected with a super serum developed by one of the Legends after he put his life on the line to protect his grandfather during a missionin the 1940's alongside the Legends prior to joining the team. While not all members of the team are welcoming initially and as he struggles to learn and control his powers, he starts discovering what it really means to be a hero and a Legend and becomes the de-facto encyclopedia of historical record during the Legend's travels. He can also, much like his grandfather, speak several languages and has multiple degrees with avery high IQ nad also takes his place alongside Ray Palmer on the timeship as an inventor.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://imgix.bustle.com/rehost/2016/10/13/36cb61d4-ef21-4ae5-9276-db1efca0dd84.jpg",
   "photo_link_2": "https://static.comicvine.com/uploads/original/11133/111334080/6741488-5695454763-images",
   "photo_link_3": "https://images.cwtv.com/images/c/photo-gallery/dcs-legends-of-tomorrow/02355350279_983f_1280.jpg"
 },
 {
   "id": 28,
   "actor_name": "Wentworth Miller",
   "superhero_name": "Captain Cold",
   "superhero_aka1": "Citizen Cold",
   "superhero_aka2": "",
   "alter_ego_name": "Leonard Snart",
   "alter_ego_2": "Leo Snart",
   "character_description": "Leonard Snart is the kind of villain who makes for the perfect origin story of a hero. Starting out as a notorious and uncatchable Jewel Thief, known for impossible heists alongside his partner in crime, Mick Rory, after getting his hands on a weapon developed by STAR Labs' Cisco Ramon capable of discharging blasts of air and ice at absolute zero, he becomes the villain known as Captain Cold, one of the only villains who is aware of the Flash's true identity as Barry Allen, which he, early in his career as Captain Cold, leverages to get away with his heists after striking a deal with Barry that he will not kill but if Barry does catch him or tries to stip him, his identity as the Flash will be exposed to the world. Over time however, he starts to change colors, initially helping the Flash on the grounds that their was money involved and later becoming a full-time hero with the Legends. After his death at the hands of the Time Masters in order to save the other Legends, another iteration is met by the team in the form of Earth X's Leo Snart, a member of the resistance against his Earth's leadership's tyrannical regime and Citizen Cold, a hero. He proceeds to join the Legends temporarily after the loss of one of their own in order to help them cope and to lend an extra hand. He also ends out assisting the Flash on a few occassions and helps that team heal as well after a dvestating defeat in which they almost lose one of their own.",
   "multiverse_hero": "Yes",
   "which_earth": "Earth Prime",
   "which_earth_2": "Earth 2",
   "which_earth_3": "Earth X",
   "photo_link": "https://i.pinimg.com/originals/df/cb/ee/dfcbeeaf0900d03273f71a959b0098ba.jpg",
   "photo_link_2": "https://static.wikia.nocookie.net/vsbattles/images/d/d5/Leo_Snart.png/revision/latest?cb=20180501164550",
   "photo_link_3": "https://i.pinimg.com/originals/11/6b/b7/116bb7f83645c1e106b88226d1e6b46a.jpg"
 },
 {
   "id": 29,
   "actor_name": "Keiynan Lonsdale",
   "superhero_name": "Kid Flash",
   "superhero_aka1": "The Flash v3",
   "superhero_aka2": "",
   "alter_ego_name": "Wally West",
   "alter_ego_2": "",
   "character_description": "Wally West was a street racer with a need for speed and more importantly, money to pay his mother's hospital bills when he is met by his long lost sister. After being sperated from his father and sister from birth by their estranged mother, after discovering the existence of his sister and father and learning about the identity of his foster brother, he begins trying to pay the team back for all the occasions he has been saved by them by trying to utlize his knowledge of the streets and street racing as a vigilante in his own right. However, after a timeline altering event in which he temporarily taken on the mantle of The Flash, he recieves powers of his own and becomes the hero known as Kid Flash.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://blackgirlnerds.com/wp-content/uploads/2017/10/episode-3.jpg",
   "photo_link_2": "https://tvline.com/wp-content/uploads/2018/06/flash-legends-keiynan-lonsdale-quits.jpg?w=624",
   "photo_link_3": "https://ourdailynewsonline.com/wp-content/uploads/2017/10/kid-flash-copy.jpg"
 },
 {
   "id": 30,
   "actor_name": "Emily Bett Rickards",
   "superhero_name": "Overwatch",
   "superhero_aka1": "The Calculator",
   "superhero_aka2": "",
   "alter_ego_name": "Felicity Smoak",
   "alter_ego_2": "",
   "character_description": "Who is Felicity Smoak? Hacker? Activist? Genius? Vigilante? or possibly even Superhero? One could possibly associate all of these terms with her. Felicity started her adventures as a vigilante and hacker long before meeting Oliver Queen and becoming a member of the Green Arrow's team. In college, Felicity, self-admittedly, went down a dark path when she tried to become a 'hacktivist' but gave that life up to become a member of the IT Staff at Queen Consolidated along with a brand new look after the supposed death of her partner in crime after his arrest. A few years from that time, Felicity would go on to meet Oliver Queen upon his return from the island and would promptly start performing ridiculous internet searches at his request. Upon learning of his identity as the Green Arrow and his time as a vigilante, instead of reporting him, she decided to join his team and a technical expert and would go on to become his most trusted friend, advisor and one day, his wife. However, in the year 2040, after helping her daughter, Mia and her team, defeat Eden Corps, she, with the help of the Monitor, joined her husband who died in the Anti-Monitor Crisis in 2020, in the afterlife.",
   "multiverse_hero": "No",
   "which_earth": "Earth Prime",
   "which_earth_2": "",
   "which_earth_3": "",
   "photo_link": "https://vignette.wikia.nocookie.net/virtual-land/images/8/8a/Felicity_Smoak_%28Arrow%29_002.png/revision/latest?cb=20160820154434",
   "photo_link_2": "https://2.bp.blogspot.com/-S5h2YwFgiDU/WNTvUQhk4KI/AAAAAAACEz4/yakMm1uVgMM6by2KxhG7845BdArYpu4OACLcB/s1600/OVERWATCH%2BFELICITY%2BSMOAK.png",
   "photo_link_3": "https://www.dccomics.com/sites/default/files/imce/2019/05-MAY/source-AR714B0002b_5ce348370537b1.03603855.jpg"
 }
]
